In [1]:
import pandas as pd

In [2]:
# empty daraframe example
df = pd.DataFrame()

In [3]:
df.head()

Empty DataFrame
Columns: []
Index: []

In [4]:
books = [
    {
        "title": "Extreme Ownership",
        "author": "Jocko Willink"
    },
    {
        "title": "12 Rules for Life",
        "author": "Jordan Peterson"
    },
    {
        "title": "Peace is Every Step",
        "author": "Thich Nhat Hanh"
    },
]

In [5]:
df = pd.DataFrame(books)
df

                 title           author
0    Extreme Ownership    Jocko Willink
1    12 Rules for Life  Jordan Peterson
2  Peace is Every Step  Thich Nhat Hanh

In [7]:
df.head(2)

               title           author
0  Extreme Ownership    Jocko Willink
1  12 Rules for Life  Jordan Peterson

In [8]:
df.title

0      Extreme Ownership
1      12 Rules for Life
2    Peace is Every Step
Name: title, dtype: object

In [9]:
df["title"]

0      Extreme Ownership
1      12 Rules for Life
2    Peace is Every Step
Name: title, dtype: object

- . notation indicates an object

- [] notation indicates a list of dictionary

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
title     3 non-null object
author    3 non-null object
dtypes: object(2)
memory usage: 176.0+ bytes

- ***range index - autoincrementing indicies***

In [13]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [18]:
df.columns = df.columns.str.lower()

In [19]:
df.columns

Index(['title', 'author'], dtype='object')

In [20]:
df.describe()

                      title           author
count                     3                3
unique                    3                3
top     Peace is Every Step  Jordan Peterson
freq                      1                1

In [21]:
df.title
df["title"]

0      Extreme Ownership
1      12 Rules for Life
2    Peace is Every Step
Name: title, dtype: object

In [23]:
df["quantity"] = [10, 20, 100]

In [24]:
df

                 title           author  quantity
0    Extreme Ownership    Jocko Willink        10
1    12 Rules for Life  Jordan Peterson        20
2  Peace is Every Step  Thich Nhat Hanh       100

In [25]:
df["price"] = [50, 14.5, 12]

In [26]:
df

                 title           author  quantity  price
0    Extreme Ownership    Jocko Willink        10   50.0
1    12 Rules for Life  Jordan Peterson        20   14.5
2  Peace is Every Step  Thich Nhat Hanh       100   12.0

In [63]:
df["inventory_value"] = df["price"] * df["quantity"]

In [28]:
df

                 title           author  quantity  price  inventory_value
0    Extreme Ownership    Jocko Willink        10   50.0            500.0
1    12 Rules for Life  Jordan Peterson        20   14.5            290.0
2  Peace is Every Step  Thich Nhat Hanh       100   12.0           1200.0

In [29]:
df.price = df.price * 2

In [30]:
df

                 title           author  quantity  price  inventory_value
0    Extreme Ownership    Jocko Willink        10  100.0            500.0
1    12 Rules for Life  Jordan Peterson        20   29.0            290.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0           1200.0

In [31]:
df["inventory_value"] = df.price * df.quantity

In [32]:
df

                 title           author  quantity  price  inventory_value
0    Extreme Ownership    Jocko Willink        10  100.0           1000.0
1    12 Rules for Life  Jordan Peterson        20   29.0            580.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0           2400.0

In [33]:
df.describe()

         quantity       price  inventory_value
count    3.000000    3.000000         3.000000
mean    43.333333   51.000000      1326.666667
std     49.328829   42.508823       952.960300
min     10.000000   24.000000       580.000000
25%     15.000000   26.500000       790.000000
50%     20.000000   29.000000      1000.000000
75%     60.000000   64.500000      1700.000000
max    100.000000  100.000000      2400.000000

In [35]:
df[["quantity", "price", "inventory_value"]]

   quantity  price  inventory_value
0        10  100.0           1000.0
1        20   29.0            580.0
2       100   24.0           2400.0

In [36]:
df[["title", "author"]]

                 title           author
0    Extreme Ownership    Jocko Willink
1    12 Rules for Life  Jordan Peterson
2  Peace is Every Step  Thich Nhat Hanh

In [37]:
df[["quantity", "price", "inventory_value"]].describe()

         quantity       price  inventory_value
count    3.000000    3.000000         3.000000
mean    43.333333   51.000000      1326.666667
std     49.328829   42.508823       952.960300
min     10.000000   24.000000       580.000000
25%     15.000000   26.500000       790.000000
50%     20.000000   29.000000      1000.000000
75%     60.000000   64.500000      1700.000000
max    100.000000  100.000000      2400.000000

In [38]:
x = df[["quantity", "price", "inventory_value"]].describe()

- ***get a copy of the dataframe with double brackets as shown above***

In [39]:
type(x)

pandas.core.frame.DataFrame

In [40]:
x.columns

Index(['quantity', 'price', 'inventory_value'], dtype='object')

In [42]:
df.dtypes

title               object
author              object
quantity             int64
price              float64
inventory_value    float64
dtype: object

In [43]:
type(df.dtypes)

pandas.core.series.Series

In [44]:
df.price > 30

0     True
1    False
2    False
Name: price, dtype: bool

- ***each column in a data frame is a series***

In [45]:
df.T

                                 0                  1                    2
title            Extreme Ownership  12 Rules for Life  Peace is Every Step
author               Jocko Willink    Jordan Peterson      Thich Nhat Hanh
quantity                        10                 20                  100
price                          100                 29                   24
inventory_value               1000                580                 2400

In [46]:
df

                 title           author  quantity  price  inventory_value
0    Extreme Ownership    Jocko Willink        10  100.0           1000.0
1    12 Rules for Life  Jordan Peterson        20   29.0            580.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0           2400.0

In [50]:
df.title[df.author.str.contains("Jordan")]

1    12 Rules for Life
Name: title, dtype: object

In [55]:
# or is accomplished with |
# and is accomplished with &
df[df.author.str.contains("Jordan") | df.title.str.contains("Peace")]

                 title           author  quantity  price  inventory_value
1    12 Rules for Life  Jordan Peterson        20   29.0            580.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0           2400.0

In [64]:
# Mutating in place vs. returning a copy
df.drop(columns=["inventory_value"]) # .drop returns a copy
# we can reassign a copy to a variable, if needed

                 title           author  quantity  price
0    Extreme Ownership    Jocko Willink        10  100.0
1    12 Rules for Life  Jordan Peterson        20   29.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0

In [65]:
df

                 title           author  quantity  price  inventory_value
0    Extreme Ownership    Jocko Willink        10  100.0           1000.0
1    12 Rules for Life  Jordan Peterson        20   29.0            580.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0           2400.0

In [60]:
df.drop(columns=["inventory_value"], inplace=True) # inplace mutates the original

In [61]:
df

                 title           author  quantity  price
0    Extreme Ownership    Jocko Willink        10  100.0
1    12 Rules for Life  Jordan Peterson        20   29.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0

In [66]:
x = df.drop(columns=["inventory_value"], inplace=True)

In [68]:
type(x)

NoneType

In [69]:
df

                 title           author  quantity  price
0    Extreme Ownership    Jocko Willink        10  100.0
1    12 Rules for Life  Jordan Peterson        20   29.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0

In [70]:
x = df

In [71]:
x

                 title           author  quantity  price
0    Extreme Ownership    Jocko Willink        10  100.0
1    12 Rules for Life  Jordan Peterson        20   29.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0

In [72]:
x["value"] = x.quantity * x.price

In [73]:
df

                 title           author  quantity  price   value
0    Extreme Ownership    Jocko Willink        10  100.0  1000.0
1    12 Rules for Life  Jordan Peterson        20   29.0   580.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0  2400.0

## Use df.copy() to make a real copy as opposed to the method detailed above where "x" and "df" hold the same dataframe

In [74]:
y = df.copy()

In [75]:
y = y.drop(columns=["quantity", "price"])

In [76]:
y

                 title           author   value
0    Extreme Ownership    Jocko Willink  1000.0
1    12 Rules for Life  Jordan Peterson   580.0
2  Peace is Every Step  Thich Nhat Hanh  2400.0

In [77]:
df

                 title           author  quantity  price   value
0    Extreme Ownership    Jocko Willink        10  100.0  1000.0
1    12 Rules for Life  Jordan Peterson        20   29.0   580.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0  2400.0

In [78]:
df.sort_values(by="author")

                 title           author  quantity  price   value
0    Extreme Ownership    Jocko Willink        10  100.0  1000.0
1    12 Rules for Life  Jordan Peterson        20   29.0   580.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0  2400.0

In [80]:
df.sort_values(by="price", ascending=False)

                 title           author  quantity  price   value
0    Extreme Ownership    Jocko Willink        10  100.0  1000.0
1    12 Rules for Life  Jordan Peterson        20   29.0   580.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0  2400.0

In [82]:
df.sort_values(by="value", ascending=False)

                 title           author  quantity  price   value
2  Peace is Every Step  Thich Nhat Hanh       100   24.0  2400.0
0    Extreme Ownership    Jocko Willink        10  100.0  1000.0
1    12 Rules for Life  Jordan Peterson        20   29.0   580.0

In [85]:
df.sort_values(["value", "price"])

                 title           author  quantity  price   value
1    12 Rules for Life  Jordan Peterson        20   29.0   580.0
0    Extreme Ownership    Jocko Willink        10  100.0  1000.0
2  Peace is Every Step  Thich Nhat Hanh       100   24.0  2400.0

In [87]:
df.sort_values?